Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Unfortunately the phoneme databases are for non-military and non-commercial use only.
pt_pt: Infelizmente, os bancos de dados de fonemas são apenas para uso não militar e não comercial.

source: We are lacking free phoneme databases in order to be used in the Debian Operating System.
pt_pt: Temos uma ausência de bancos de dados de fonemas para serem usados no sistema operacional Debian.

source: Without a broadly multi-lingual software speech synthesizer, Linux cannot be accepted by assistive technology providers and people with visual disabilities.
pt_pt: Sem um software sintetizador de fala amplamente multi-idioma, o Linux não pode ser aceito por provedores de tecnologia assistiva e pessoas com deficiências visuais.

source: What can we do to improve this?
pt_pt: O que podemos fazer para melhorar isso?

source: There are basically two approaches possible:
pt_pt: Existem basicamente duas abordagens possíveis:

source: Organize a group of people willing to help in this regard, and try to actively improve the situation.
pt_pt: Organizar um grupo de pessoas dispostas a ajudar nesta questão e tentar, ativamente, melhorar a situação.

source: This might get a bit complicated, since a lot of specific knowledge about speech synthesis will be required, which isn't that easy if done via an autodidactic approach.
pt_pt: Isto pode ser um pouco complicado, já que é necessário um grande conhecimento específico sobre síntese de fala, e tal conhecimento não é fácil de se obter por meio de uma abordagem autodidata.

source: However, this should not discourage you.
pt_pt: Entretanto, isto não deve desencorajar você.

source: If you think you can motivate a group of people large enough to achieve some improvements, it would be worthwhile to do.
pt_pt: Se você acha que pode motivar um grupo de pessoas grande o suficiente para alcançar algumas melhorias, pode ser que valha a pena fazê-lo.

source: Obtain funding and hire some institute which already has the know how to create the necessary phoneme databases, lexica and transformation rules.
pt_pt: Obter financiamento e contratar um instituto que já tenha experiência na criação dos bancos de dados de fonemas necessários, regras léxica e de transformação.

source: This approach has the advantage that it has a better probability of generating quality results, and it should also achieve some improvements much earlier than the first approach.
pt_pt: Esta abordagem tem a vantagem de obter uma maior probabilidade de gerar resultados com qualidade e deve alcançar algumas melhorias muito mais cedo do que a primeira abordagem.

source: Of course, the license under which all resulting work would be released should be agreed on in advance, and it should pass the DFSG requirements.
pt_pt: Claro que a licença sob a qual todo o trabalho produzido deve ser lançado deve ser acordado antecipadamente, e deve passar pelos requisitos da DFSG.

source: The ideal solution would of course be to convince some university to undergo such a project on their own dime, and contribute the results to the Free Software community.
pt_pt: A solução ideal seria, com certeza, convencer alguma universidade a perfazer tal projeto com seu próprio dinheiro e contribuir com os resultados para a comunidade de software livre.

source: Last but not least, it seems most of the commercially successful speech synthesis products nowadays do no longer use concatenative speech synthesis, mainly because the sound databases consume a lot of diskspace.
pt_pt: Por fim, mas não menos importante, parece que os produtos de síntese de fala de maior sucesso comercial hoje não usam mais a síntese de fala por concatenação, principalmente porque os bancos de dados de sons consomem muito espaço de disco.

source: This is not really desirable for small embedded products, like for instance speech on a mobile phone.
pt_pt: Isto não é realmente desejado para pequenos produtos embarcados, como por exemplo fala em telefones celulares.

source: Recently released Free software like eSpeak seem to try this approach, which might be very worthwhile to look at.
pt_pt: Softwares livres recentemente lançados como o eSpeak parecem tentar esta abordagem, o que pode ser muito vantajoso dar uma olhada.

source: Screen review extensions for Emacs
pt_pt: Extensões do Emacs para leitura de tela

source: A speech output system that will allow someone who cannot see to work directly on a UNIX system.
pt_pt: Um sistema de produção de fala que permitirá a alguém com deficiência visual trabalhar diretamente em um sistema UNIX.

source: Once you start Emacs with Emacspeak loaded, you get spoken feedback for everything you do.
pt_pt: Uma vez que se inicie o Emacs com o Emacspeak carregado, recebe-se um retorno falado para tudo o que se faz.

source: Your mileage will vary depending on how well you can use Emacs.
pt_pt: Seu benefício dependerá de quão bem você usa o Emacs.

source: There is nothing that you cannot do inside Emacs :-).
pt_pt: Não há nada que você não possa fazer dentro do Emacs :-).

source: This package includes speech servers written in tcl to support the DECtalk Express and DECtalk MultiVoice speech synthesizers.
pt_pt: Este pacote inclui servidores de fala escritos em tcl para suporte ao sintetizadores de fala DECtalk Express e DECtalk MultiVoice.

source: For other synthesizers, look for separate speech server packages such as Emacspeak-ss or eflite.
pt_pt: Para outros sintetizadores, procure por pacotes de servidores de fala separados, como o Emacspeak-ss ou eflite.

source: Emacs client to speech synthesizers, Braille displays and other alternative output interfaces.
pt_pt: Cliente Emacs para sintetizadores de fala, linhas braille e outras interfaces de saída alternativas.

source: It provides full speech and Braille output environment for Emacs.
pt_pt: Ele fornece um ambiente de saída completo de fala e braille para Emacs.

source: It is aimed primarily at visually impaired users who need non-visual communication with Emacs, but it can be used by anybody who needs sophisticated speech or other kind of alternative output from Emacs.
pt_pt: Ele destina-se primeiramente para usuários(as) com deficiência visual que precisam de comunicação não visual com o Emacs, mas pode ser usado por qualquer pessoa que necessite de fala sofisticada ou outro tipo de saída alternativa do Emacs.

source: Console (text-mode) screen readers
pt_pt: Leitores de tela para console (modo texto)

source: A thorough list is available on the console screen readers task page
pt_pt: Uma lista minuciosa está disponível na página da tarefa dos leitores de tela para console

source: A daemon which provides access to the Linux console for a blind person using a soft braille display.
pt_pt: Um daemon que fornece acesso ao console do Linux para uma pessoa com deficiência visual que esteja usando uma linha braille.

source: It drives the braille terminal and provides complete screen review functionality.
pt_pt: Ele controla o terminal braille e fornece uma funcionalidade completa de leitura de tela.

source: The Braille devices supported by BRLTTY are listed on the BRLTTY device documentation
pt_pt: Os dispositivos Braille suportados pelo BRLTTY estão listados na documentação de dispositivos BRLTTY

source: BRLTTY also provides a client/server based infrastructure for applications wishing to utilize a Braille display.
pt_pt: O BRLTTY também fornece uma infraestrutura baseada em cliente/servidor para aplicações que desejem utilizar uma linha braille.

source: The daemon process listens for incoming TCP/IP connections on a certain port.
pt_pt: O processo daemon aguarda por conexões TCP/IP de entrada em uma certa porta.

source: A shared object library for clients is provided in the package libbrlapi.
pt_pt: Uma biblioteca compartilhada de objetos para clientes é fornecida no pacote libbrlapi.

source: A static library, header files and documentation is provided in package libbrlapi-dev.
pt_pt: Uma biblioteca estática, arquivos de cabeçalho e documentação são fornecidos no pacote libbrlapi-dev.

source: This functionality is for instance used by Orca to provide support for display types which are not yet support by Gnopernicus directly.
pt_pt: Esta funcionalidade é, portanto, usada pelo Orca para fornecer suporte para tipos de linhas braille que ainda não são suportadas diretamente pelo Gnopernicus.

source: A general-purpose console screen reader for GNU/Linux and other UNIX-like operating systems.
pt_pt: Um console de leitor de tela de propósito geral para GNU/Linux e outros sistemas operacionais UNIX-like.

source: The name yasr is an acronym that can stand for either Yet Another Screen Reader or Your All-purpose Screen Reader.
pt_pt: O nome yasr é um acrônimo que pode significar tanto Yet Another Screen Reader (ainda outro leitor de tela) ou Your All-purpose Screen Reader (seu leitor de tela para todos os propósitos).

source: Currently, yasr attempts to support the Speak-out, DEC-talk, BNS, Apollo, and DoubleTalk hardware synthesizers.
pt_pt: Atualmente, o yasr tenta suportar os hardwares sintetizadores Speak-out, DEC-talk, BNS, Apollo e DoubleTalk.

source: It is also able to communicate with Emacspeak speech servers and can thus be used with synthesizers not directly supported, such as Festival Lite (via eflite) or FreeTTS.
pt_pt: Ele também consegue se comunicar com os servidores de fala Emacspeak e desse modo pode ser usado com sintetizadores que ainda não são suportados, como o Festival Lite (via eflite) ou FreeTTS.

source: Yasr works by opening a pseudo-terminal and running a shell, intercepting all input and output.
pt_pt: O Yasr funciona abrindo um pseudo-terminal e executando um interpretador de comandos, interceptando todas as entradas e saídas.

source: It looks at the escape sequences being sent and maintains a virtual window containing what it believes to be on the screen.
pt_pt: Ele olha para todas as sequências de escape que estão sendo enviadas e mantém uma janela virtual contendo o que ele acredita que esteja na tela.

source: It thus does not use any features specific to Linux and can be ported to other UNIX-like operating systems without too much trouble.
pt_pt: Ele então não usa qualquer funcionalidade específica do Linux e pode ser portado para outros sistemas operacionais UNIX-like sem muitas preocupações.

source: Graphical User Interfaces
pt_pt: Interfaces gráficas do(a) usuário(a)

source: Accessibility of graphical user interfaces on UNIX platforms has only recently received a significant upswing with the various development efforts around the GNOME Desktop, especially the GNOME Accessibility Project.
pt_pt: Somente recentemente a acessibilidade em interfaces gráficas de usuários(as) em plataformas UNIX receberam aperfeiçoamentos significativos com os vários esforços de desenvolvimento em torno do Desktop GNOME, especialmente o projeto de acessibilidade do GNOME. (GNOME Accessibility Project).

source: GNOME Accessibility Software
pt_pt: Software de acessibilidade do GNOME

source: A thorough list is available on the Gnome accessibility task page
pt_pt: Uma lista minuciosa está disponível na página da tarefa Gnome accessibility

source: This package contains the core components of GNOME Accessibility.
pt_pt: Este pacote contém os componentes essenciais de acessibilidade do GNOME.

source: It allows Assistive technology providers like screen readers to query all applications running on the desktop for accessibility related information as well as provides bridging mechanisms to support other toolkits than GTK.
pt_pt: Ele permite que fornecedores de tecnologia assistiva, como leitores de tela, requisitem informações relativas à acessibilidade para todas as aplicações que estejam executando no desktop, como também fornece mecanismos de ligação para suportar outros conjuntos de ferramentas que não o GTK.

source: Bindings to the Python language are provided in package python-at-spi.
pt_pt: Conexões com a linguagem Python são fornecidas no pacote python-at-spi.

source: ATK is a toolkit providing accessibility interfaces for applications or other toolkits.
pt_pt: O ATK é um conjunto de ferramentas que fornece interfaces de acessibilidade para aplicações ou para outros conjuntos de ferramentas.

source: By implementing these interfaces, those other toolkits or applications can be used with tools such as screen readers, magnifiers, and other alternative input devices.
pt_pt: Ao implementar essas interfaces, esses outros conjuntos de ferramentas ou aplicações podem ser usados com ferramentas como leitores de tela, lentes de aumento e dispositivos alternativos de entrada.

source: The runtime part of ATK, needed to run applications built with it is available in package libatk1.0-0.
pt_pt: A parte de runtime do ATK, necessária para executar aplicações construídas com ele, está disponível no pacote libatk1.0-0.

source: Development files for ATK, needed for compilation of programs or toolkits which use it are provided by package libatk1.0-dev.
pt_pt: Arquivos de desenvolvimento para o ATK, necessários para compilação de programas ou conjuntos de ferramentas que o utilizam, são fornecidos pelo pacote libatk1.0-dev.

source: Ruby language bindings are provided by package ruby-atk.
pt_pt: Conexões com a linguagem Ruby são fornecidos pelo pacote ruby-atk.

source: The gnome-accessibility-themes package contains some high accessibility themes for the GNOME desktop environment, designed for the visually impaired.
pt_pt: O pacote gnome-accessibility-themes contém alguns temas de grande acessibilidade para o ambiente de área de trabalho do GNOME, projetados para pessoas com baixa visão.

source: A total of 7 themes are provided, providing combinations of high, low or inversed contrast, as well as enlarged text and icons.
pt_pt: Um total de 7 temas são fornecidos, possibilitando combinações de contraste alto, baixo ou invertido, como também texto e ícones ampliados.

source: Orca is a flexible and extensible screen reader that provides access to the graphical desktop via user-customizable combinations of speech, braille, and/or magnification.
pt_pt: O Orca é um leitor de tela flexível e extensível que fornece acesso à área de trabalho gráfica através de combinações de fala, braille e/ou ampliação, combinações que podem ser personalizadas pelo(a) usuário(a).

source: Under development by the Sun Microsystems, Inc., Accessibility Program Office since 2004, Orca has been created with early input from and continued engagement with its end users.
pt_pt: Sob o desenvolvimento da Sun Microsystems, Inc., Accessibility Program Office desde 2004, o Orca foi criado desde o início com o envolvimento de seus(as) usuários(as) finais, e assim continua até hoje.

source: Orca can use Speech Dispatcher for delivering speech output to the user.
pt_pt: O Orca pode usar o Speech Dispatcher para prover saída de fala para o(a) usuário(a).

source: BRLTTY is used for braille display support (and for seamless console and GUI braille review integration).
pt_pt: O BRLTTY é usado para suporte à linha braille (e para integração suave com leitores braille de console e interface gráfica).

source: KDE Accessibility Software
pt_pt: Software de acessibilidade do KDE

source: A thorough list is available on the KDE accessibility task page
pt_pt: Uma lista minuciosa está disponível na página da tarefa KDE accessibility

source: Magnify a part of the screen just as you would use a lens to magnify a newspaper fine-print or a photograph.
pt_pt: Amplia uma parte da tela do mesmo modo como você usaria uma lente para ampliar uma letra pequena do jornal ou uma fotografia.

source: This application is useful for a variety of people: from researchers to artists to web-designers to people with low vision.
pt_pt: Esta aplicação é útil para uma variedade de pessoas: de pesquisadores(as) a artistas, de designers web até para pessoas com baixa visão.

source: Non-standard input methods
pt_pt: Métodos de entrada não padronizados

source: A thorough list is available on the Input methods task page
pt_pt: Uma lista minuciosa está disponível na página da tarefa de métodos de entrada

source: Dasher is an information-efficient text-entry interface, driven by natural continuous pointing gestures.
pt_pt: O Dasher é uma interface de entrada de texto eficiente quanto à informação, orientada por gestos naturais e contínuos de apontar.

source: Dasher is a competitive text-entry system wherever a full-size keyboard cannot be used - for example,
pt_pt: O Dasher é um sistema de entrada de texto interessante sempre que um teclado de tamanho completo não pode ser usado - por exemplo,

source: · on a palmtop computer
pt_pt: · num computador palmtop

source: · on a wearable computer
pt_pt: · num computador vestível

source: · when operating a computer one-handed, by joystick, touchscreen, trackball, or mouse
pt_pt: · ao operar um computador com uma mão, por joystick, tela sensível ao toque, trackball ou mouse

source: · when operating a computer with zero hands (i.e., by head-mouse or by eyetracker).
pt_pt: · ao operar um computador sem mãos (ou seja, com um mouse de cabeça ou com um sensor ocular).

source: The eyetracking version of Dasher allows an experienced user to write text as fast as normal handwriting - 25 words per minute; using a mouse, experienced users can write at 39 words per minute.
pt_pt: A versão com sensor ocular do Dasher permite que um(a) usuário(a) experiente escreva texto tão rápido quanto uma escrita à mão normal - 25 palavras por minuto; usando um mouse, usuários(as) experientes podem escrever 39 palavras por minuto.

source: Dasher uses a more advanced prediction algorithm than the T9(tm) system often used in mobile phones, making it sensitive to surrounding context.
pt_pt: O Dasher usa um algorítimo de predição mais avançado que o sistema T9(c) usado em telefones celulares, fazendo-o sensível ao contexto do entorno.

source: Caribou is an input assistive technology intended for switch and pointer users.
pt_pt: O Caribou é uma tecnologia de entrada assistiva direcionada para usuários(as) de controles e gestos.

source: It provides a configurable on-screen keyboard with scanning mode.
pt_pt: Ele fornece um teclado configurável em tela com modo de escaneamento.

source: Deutsch español français Italiano Nederlands Português Русский (Russkij)
pt_pt: Deutsch English español français Italiano Nederlands Русский (Russkij)

source: Last Modified: Sat, May 28 08:20:55 UTC 2022 Last Built: Tue, Aug 6 19:40:19 UTC 2024
pt_pt: Última Modificação: Seg, 6 de Jun de 2022, 22:48:51 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:39 UTC

source: Ports / PowerPC Port / PowerPC Port -- History
pt_pt: Portes / Porte para PowerPC / Porte para PowerPC -- História

source: [ Ports ] [ Debian for PowerPC ] [ Installation ] [ Documentation ] [ Development ]
pt_pt: [ Portes ] [ Debian para PowerPC ] [ Instalação ] [ Documentação ] [ Desenvolvimento ]

source: Debian/PowerPC History
pt_pt: História do Debian/PowerPC

source: The PowerPC port started in 1997 after the German Linux Kongress in Würzburg where the Debian project was sponsored a PowerPC for development issues.
pt_pt: O porte para PowerPC iniciou em 1997 após o Linux Kongress alemão em Würzburg, onde o projeto Debian recebeu um PowerPC patrocinado para questões de desenvolvimento.

source: Fortunately working boot- and rootdisks were found at LinuxPPC and we could try to install something on the machine.
pt_pt: Felizmente, boot- e rootdisks funcionais foram encontrados em LinuxPPC e nós podíamos tentar instalar algo na máquina.

source: Unfortunately this required some programs that only run under Mac OS.
pt_pt: Infelizmente, isto requeria alguns programas que somente rodavam sob o Mac OS.

source: The only way to install them was to get another machine running Mac OS who has them already installed.
pt_pt: A única maneira de instalá-los foi pegar outra máquina rodando o Mac OS que já os tinha instalados.

source: Since data exchange with other non-Mac OS machines were only able through msdos-formatted floppies this was a chicken-and-egg problem.
pt_pt: Como a troca de dados com outras máquinas não Mac OS somente era possível através de disquetes formatados em msdos, isto foi um problema do tipo "quem vem primeiro, o ovo ou a galinha".

source: Somehow we managed to hook another disk to the machine and installed Linux on it.
pt_pt: De alguma forma, conseguimos conectar um outro disco à máquina e instalar o Linux nela.

source: That was Apple's famous DR 1.
pt_pt: Isto foi a famosa DR1 da Apple.

source: Suddenly we begun to port dpkg and friends to the new system.
pt_pt: De repente, nós começamos a portar o dpkg e agreadados para o novo sistema.

source: Wow, that was possible.
pt_pt: Uau, aquilo era possível.

source: It was impressive how the first packages were ported and built.
pt_pt: Foi impressionante como os primeiros pacotes foram portados e construídos.

source: Unfortunately DR one didn't come with a dynamic linker and shared libraries.
pt_pt: Infelizmente a DR1 não vinha com um vinculador (linker) dinâmico e bibliotecas compartilhadas.

source: Another problem was that the libraries and header files seemed to be somewhat outdated and we weren't able to compile a new libc out of the box.
pt_pt: Outro problema era que as bibliotecas e os arquivos de cabeçalho pareciam estar um pouco desatualizados e nós não éramos capazes de compilar um novo libc de imediato.

source: However, the biggest and most serious problem were these suspicious crashes that also screwed the file systems entirely.
pt_pt: Contudo, o maior e mais sério problema era essas quebras suspeitas que também estragavam o sistema de arquivos por inteiro.

source: Fixable only by re-installations.
pt_pt: Corrigível somente por reinstalações.

source: Klee Dienes, another Debian Developer, worked on this problem and suddenly came up with a mklinux tarball of a more recent system - a haxored Debian GNU/Linux.
pt_pt: Klee Dienes, outro desenvolvedor Debian, trabalhou neste problema e de repente veio com um arquivo tarball mklinux de um sistema mais recente - um Debian GNU/Linux modificado.

source: This tarball came with an old 1.99 version of libc.
pt_pt: Este tarball veio com uma versão 1.99 antiga do libc.

source: From this time the machine run stable on the network and we could continue our effort.
pt_pt: Deste momento em diante a máquina rodou de maneira estável na rede e nós conseguimos continuar nossos esforços.

source: We were compiling a lot of packages and noticed that some header files were not proper and that many programs were not compilable by the regular compiler.
pt_pt: Nós estávamos compilando vários pacotes e percebemos que alguns arquivos de cabeçalho não eram apropriados e que muitos programas não foram compilados pelo compilador normal.

source: So Joel Klecker, a new Debian Developer at that time, started to work on egcs and it's compilation on the PowerPC machine.
pt_pt: Então, o Joel Klecker, um novo desenvolvedor Debian à época, começou a trabalhar no egcs e sua compilação na máquina PowerPC.

source: After this was done the next step was to work on current libc versions.
pt_pt: Após isto ter sido feito, o próximo passo foi trabalhar nas versões atuais do libc.

source: It turned out that our libc-1.99 version is incompatible to the next pre2.1 version that was needed in order to move the port into a stable state.
pt_pt: Deu-se que nossa versão libc-1.99 era incompatível com a próxima versão pre2.1 que era necessária de modo a mover o porte para o estado estável.

source: At this stage Hartmut Koptein switched over from m68k to the powerpc port and started development for it.
pt_pt: Neste estágio, Hartmut Koptein trocou do m68k para o porte para powerpc e iniciou o desenvolvimento dele.
